#include "Menu.h"
void Menu::header(){
	cout << "<===================================================================================================>" << endl;
	cout << "						 _____                                " << endl;
	cout << "						| ____|_  ___ __  _ __   ___  ___ ___ " << endl;
	cout << "						|  _| | |/ / '_ | | '__|/ _ |/ __/ __|" << endl;
	cout << "						| |___ >  <| |_) || |   | __/|__ |__ |" << endl;
	cout << "						|_____/_/|_| .__/ |_|   |___||___/___/" << endl;
	cout << "							   |_|                        " << endl;
	cout << "<=============:Доброго дня!Вас вітає автобаза 'Express', доступний функціонал програми:=============>" << endl;
	system("Color E0");
}
void Menu::showbasemenu()
{
	cout << "1.<Меню користувача>" << endl;
	cout << "2.<Меню менеджера-адміністратора(службове меню)>" << endl;
	cout << "3.<Меню тестування всіх функцій програмної системи>" << endl;
	cout << "!Натисніть 4,щоб вийти з програми" << endl;
}
void Menu::autobaseinfo() {
	cout << "================Автобаза 'Express'================" << endl;
	cout << "Заснована у 2022 році в місті Харкові. Приймає замовлення " << endl;
	cout << "з доставки грузу різного типу: сировина, мебель, техніка і т.д." << endl;
	cout << "Має в своєму автопарку близько 300 машин 'КамАЗ-5320'." << endl;
	cout << "Головний програміст програмної системи: Крутипорох Руслан Олегович." << endl;
	cout << "                                                    © 2022 Express";
}
void Menu::showusermenu() {
	cout << "<=============: 1.Оформити замовлення :=============>" << endl;
	cout << "<=============: 2.Інформація про автобазу 'Express':=============>" << endl;
	cout << "<=============: 3.Вийти в головне меню:=============>" << endl;
}
void Menu::showservicemenu() {
	cout << "<=============: 1.Зареєструвати нових водіїв:=============>" << endl;
	cout << "<=============: 2.Список замовлень у базі даних:=============>" << endl;
	cout << "<=============: 3.Повернутися до головного меню:=============>" << endl;
}
bool Menu::check() {
	int key;
	cout << "Доступ до системи закодований. Введіть ключ(рік заснування автобази):\t"; cin >> key;
	if (key != 2022) {
		return false;
	}
	else {
		return true;
	}
}